app/controllers/sessions_controller.rb

        @authhash[:token_refresh] = omniauth['credentials']['refresh_token']

        #Set Env vars
        user = User.find_by_user_id(@authhash[:uid])
---
SELECT 1 FROM "users" WHERE ("users"."user_id" = '005E0000000MH50IAG' AND "users"."id" != 2) LIMIT 1

            :profile => @authhash[:profile]
          )

          if user.save!
            # signin existing user
            # in the session his user id and the service id used for signing in is stored
            session[:user_id] = user.id
            session[:service_id] = user.services.first.id
---
INSERT INTO "users" ("active", "admin", "created_at", "email", "encrypted_password", "language", "last_modified_date", "last_status_body", "last_status_created_date", "name", "nickname", "org_id", "picture", "profile", "salt", "sfdc_refresh_token", "sfdc_token", "thumbnail", "updated_at", "user_id", "user_type", "utcOffset") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "last_modified_date" = '2011-10-18 18:03:58.000000', "updated_at" = '2011-11-16 22:20:13.409374' WHERE "users"."id" = 1
SELECT "services".* FROM "services" WHERE "services"."user_id" = 1 LIMIT 1

          user.save

          #get forcedotcom service for corresponding instance and update informaiton
          serviceauth = user.services.find(:first, :conditions => { :provider => service_route, :org_id => @authhash[:org_id]})
---
SELECT "services".* FROM "services" WHERE "services"."user_id" = 2 AND "services"."provider" = 'forcedotcom' AND "services"."org_id" = '00DE0000000KUrkMAG' LIMIT 1

            serviceauth.profile = @authhash[:profile]
          end

          serviceauth.save
---
INSERT INTO "services" ("active", "created_at", "instance_url", "last_status_created_date", "last_status_update", "org_id", "profile", "provider", "token", "token_refresh", "token_secret", "uemail", "uid", "uname", "updated_at", "user_id", "user_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "services" SET "token" = '00DE0000000KUrk!AQsAQOMt23dXJ3PWu5FvHIfMhCPTPBq0izZy.SENVB1fdJ0by1UMZRJ2L1cY6wOWFMX.IoI.qNKi_u2mSk4BEw7Pr3nhzESy', "token_refresh" = '5Aep861rEpScxnNE64TZ2nlRqChAwxbHoI7yyzjzJlNJaSlCzmjaKzwIPdiw3LviV8j3pop_MdggQ==', "updated_at" = '2011-10-03 01:33:08.842130' WHERE "services"."id" = 2